
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()    
	
	Сообщение = СервисыИнтеграции.ОтправкаВ1С.СоздатьСообщение();
	
	Сообщение.КодОтправителя = "База1";
	Сообщение.КодПолучателя = "База2";
	
	Сообщение.Параметры.Вставить("Текст", ИсходящееСообщение);

//	Состояние = СервисыИнтеграции.ОтправкаВ1С.Основной_Обмен1С_База1Отправка.ПолучитьСостояние();
//	ПодготовленныеСообщения = СервисыИнтеграции.ОтправкаВ1С.Основной_Обмен1С_База1Отправка.ВыбратьСообщения();
	
	СервисыИнтеграции.ОтправкаВ1С.Основной_Обмен1С_База1Отправка.ОтправитьСообщение(Сообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	Активный = СервисыИнтеграции.ОтправкаВ1С.ПолучитьАктивность();
	СервисыИнтеграции.ВыполнитьОбработку();
КонецПроцедуры

